modules/sst-ws/src/test/resources/SendGreetingRequestTemplate.xml

<?xml version="1.0" encoding="iso-8859-1"?>
<!--

    Copyright 2013 Information Control Corporation

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

     http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
 
-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>	     
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:UsernameToken>
				<wsse:Username>{0}</wsse:Username>
				<wsse:Password>{1}</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<sgr:SendGreetingRequest xmlns:sgr="http://www.simpliccity.org/schema/sst/test/access">
			<sgr:from>{2}</sgr:from>
			<sgr:to>{3}</sgr:to>
			<sgr:message>{4}</sgr:message>
		</sgr:SendGreetingRequest>
	</soap:Body>
</soap:Envelope>
